// b_sh.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include "S_box.h"

int main()
{
	S_box s("test.txt");
	s.print();
	s.rev_Pi().print();
	std::vector<unsigned short> d_s = s.differential_uniformity();
	for (char i = 0; i < 3; ++i)
		std::cout <<d_s[i] << ' ';
	std::cout << '\n';
	std::vector <unsigned short> ad_s = s.algebraic_degree();
	for (char i = 0; i < 2; ++i)
		std::cout << ad_s[i] << ' ';
	std::cout << '\n';
	std::vector<unsigned short> l_s = s.linear_characteristic();
	for (unsigned i = 0; i < 4; ++i)
		std::cout << l_s[i] << ' ';
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
